/**
 *? Напишіть через свіч пошук автора мови програмування.
 *? Пишемо назву мови у шаблонному рядку отримує відповідь
 *? мова та автор
 *? PHP Расмус Лердорф
 *? C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
 *? Swift Кріс Латтнер
 *? JS Брендан Ейх
 *? Java Джеймс Гослінг
 *? Python Гвідо ван Россум
 */

function searchAuthor(language) {
  switch (language) {
    case "PHP":
      return "Расмус Лердорф";
    case "C#":
      return "група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота";
    case "Swift":
      return "Кріс Латтнер";
    case "JS":
      return "Брендан Ейх";
    case "Java":
      return "Джеймс Гослінг";
    case "Python":
      return "Гвідо ван Россум";
    default:
      return "Такого немає";
  }
}
console.log(searchAuthor(""));
